{
  "backend/main.mo": "Defines the canister actor and a large set of public types for activities, reminders, journals, finances, habits, and user profiles.",
  "feature_evidence.json": "Lists evidence for a feature request removing footer text, including affected file, components, and test ID.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files describing their roles and UI behaviors.",
  "frontend/index.css": "Sets global Tailwind CSS variables and themes for light and dark modes with OKLCH color values.",
  "frontend/index.html": "Basic HTML shell loading Nunito font and mounting the React app.",
  "frontend/src/App.tsx": "Main app component handling theming, layout, date selection, profile setup gating, and routing between daily and main dashboards.",
  "frontend/src/components/activities/DailyTimeline.tsx": "Renders a daily timeline of activities with hour markers and proportional colored segments.",
  "frontend/src/components/AppButton.tsx": "Wrapper around the UI Button component applying a shared app-button class.",
  "frontend/src/components/CalendarView.tsx": "Monthly calendar component with reminder indicators, month navigation, and date selection.",
  "frontend/src/components/charts/PiePercentLabel.tsx": "Custom Recharts pie slice percentage label positioned inside slices with mobile sizing.",
  "frontend/src/components/DailyDashboard.tsx": "Daily dashboard with tabbed sections for overview, activities, finance, habits, and journal.",
  "frontend/src/components/Footer.tsx": "Footer container with layout preserved and all branding text removed.",
  "frontend/src/components/Header.tsx": "Top navigation header with theme toggle, view switching, and user auth menu handling logout and profile loading.",
  "frontend/src/components/LoginButton.tsx": "Login button that triggers Internet Identity login and retries on stale sessions.",
  "frontend/src/components/MainDashboard.tsx": "Main dashboard showing multi‑day finance, habit, and activity trend charts with timeframe switching.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or repairing a user profile by submitting a username.",
  "frontend/src/components/sections/DailyOverviewSection.tsx": "Daily overview section aggregating activities, finances, habits, and journal data into charts.",
  "frontend/src/components/sections/FinanceSection.tsx": "Displays daily finance entries, allows creating and deleting items, and shows income/expense/investment distribution via a pie chart.",
  "frontend/src/components/sections/HabitsSection.tsx": "Manages daily habits with create, update, delete, and completion toggling, plus a pie chart summarizing progress.",
  "frontend/src/components/sections/JournalSection.tsx": "Loads, edits, and saves a daily journal entry with autoset content and identity-gated saving.",
  "frontend/src/components/sections/OverviewSection.tsx": "Handles creation and deletion of daily activities, computes durations, groups entries, and displays them in a timeline.",
  "frontend/src/components/sections/RemindersSection.tsx": "Manages daily reminders with add and delete actions and displays them in a styled card.",
  "frontend/src/hooks/useActor.ts": "Creates and maintains a backend actor tied to user identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity, handling identity loading, login, logout, and authentication status states.",
  "frontend/src/hooks/useIsMobile.ts": "React hook that tracks if the viewport width is below 768px.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, activities, and setup status using an actor and identity.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables, themes, typography, and component styling.",
  "frontend/src/main.tsx": "App entry point that sets up React Query and Internet Identity providers before rendering the app.",
  "frontend/src/utils/activityColors.ts": "Generates deterministic OKLCH-based activity colors using string hashing.",
  "frontend/src/utils/activityTime.ts": "Utility functions for parsing times and sorting activities by time of day.",
  "frontend/src/utils/errors.ts": "Normalizes backend error objects into user-friendly messages.",
  "frontend/src/utils/localDate.ts": "Local date helpers for formatting, parsing, generating ranges, and validating YYYY-MM-DD strings without timezone issues.",
  "frontend/src/utils/timelineStyles.ts": "Builds gradient and glow styles for timeline segments based on OKLCH colors.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and remove sensitive values from the hash.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, fonts, animations, and container settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Describes the project's state, features, and architecture, including authentication, frontend tech stack, and backend capabilities."
}