{
  "backend/main.mo": "Motoko canister actor defining the core domain model and types for the app, including activities, reminders, todos, finance, habits, journals, dashboards, user profiles, themes, languages, and access control structures.",
  "feature_evidence.json": "Machine-readable report documenting implemented frontend features, affected files, dependencies, test requirements, and confidence levels for recent dashboard and mobile UI changes.",
  "frontend-file-summaries.txt": "Prewritten high-level summaries of frontend source files describing each component’s purpose, layout behavior, authentication guards, and styling conventions.",
  "frontend/index.css": "Global Tailwind CSS configuration defining light and dark theme variables, OKLCH color tokens, chart colors, sidebar styles, and shared base styles.",
  "frontend/index.html": "HTML entry point that sets viewport metadata, page title, root mounting element, and loads the React application bundle.",
  "frontend/src/App.tsx": "Root React component managing theme, authentication state, profile setup modal, and switching between Daily View and Main Dashboard layouts.",
  "frontend/src/components/AppButton.tsx": "Reusable button wrapper around the base UI Button component that standardizes styling and forwards refs.",
  "frontend/src/components/CalendarView.tsx": "Interactive monthly calendar component with month navigation, today selection, date highlighting, and reminder indicators integrated with authentication state.",
  "frontend/src/components/DailyDashboard.tsx": "Renders the daily dashboard view with a formatted date header and tabbed sections for overview, activities, finance, habits, and journal based on a selected date.",
  "frontend/src/components/Footer.tsx": "Simple footer component displaying a muted copyright notice and visual separation from the main content.",
  "frontend/src/components/Header.tsx": "Top navigation bar handling app branding, view switching (main vs daily), theme toggling, authentication state, and user menu with profile and logout actions.",
  "frontend/src/components/LoginButton.tsx": "Login button component that initiates Internet Identity authentication, handles loading state, and retries login on stale sessions.",
  "frontend/src/components/MainDashboard.tsx": "Main analytics dashboard showing trends over the last 7 or 30 days, including finance, habits, income/expenses, investments, and time-spent charts.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for creating or repairing a user profile by setting a username, with form validation and backend persistence.",
  "frontend/src/components/sections/DailyOverviewSection.tsx": "Displays a per-day summary with pie charts for activities, finances, and habits completion, aggregating data fetched for the selected date.",
  "frontend/src/components/sections/FinanceSection.tsx": "Daily finance management section allowing users to create, delete, summarize, and visualize income, expenses, and investments for a selected date.",
  "frontend/src/components/sections/HabitsSection.tsx": "React section that displays daily habits, allows creating, toggling completion, and deleting habits, and visualizes completion progress with a pie chart. It relies on Internet Identity for authentication and react-query hooks for CRUD operations.",
  "frontend/src/components/sections/JournalSection.tsx": "Daily journal section that loads, edits, and saves a text journal entry for a selected date. It supports create/update flows via react-query and requires Internet Identity to enable saving.",
  "frontend/src/components/sections/OverviewSection.tsx": "Time-based activities section that lists daily activities and allows creating and deleting them through a dialog form. It computes and displays activity durations and requires authentication for mutations.",
  "frontend/src/components/sections/RemindersSection.tsx": "Section for managing reminders for a specific date, including listing, creating, and deleting reminders. Uses dialog-based input, react-query hooks, and Internet Identity checks.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches a backend actor instance based on the current Internet Identity using react-query. It reinitializes access control, handles anonymous actors, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hook for managing Internet Identity login state, identity persistence, and login/logout actions. It wraps the app with a provider that exposes identity, status flags, and AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, activities, finances, habits, journals, reminders, and related data via a backend actor, with authentication checks, cache invalidation, and toast-based error/success handling.",
  "frontend/src/index.css": "Configures Tailwind CSS base styles, CSS variables for light/dark themes, section-specific accent colors, and reusable component styles such as dashboard cards with hover effects.",
  "frontend/src/main.tsx": "Bootstraps the React application, setting up the React Query client and Internet Identity provider before rendering the root App component.",
  "frontend/src/utils/errors.ts": "Provides a utility to normalize backend and runtime errors into clear, user-friendly English messages, handling common authentication and authorization cases.",
  "frontend/src/utils/localDate.ts": "Implements local date utilities that work with YYYY-MM-DD strings to avoid timezone issues, including formatting, parsing, ranges, and common date calculations.",
  "frontend/src/utils/urlParams.ts": "Contains helpers for reading URL parameters from query strings or hash routes, persisting them in sessionStorage, and safely managing or clearing sensitive parameters.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling class-based dark mode, custom color tokens via CSS variables, extended theme settings, animations, and additional plugins.",
  "project_state.json": "Project-level state and feature inventory describing DailyOS, a personal daily tracking web app on the Internet Computer with calendar-based UI, analytics, and role-based access control. Captures schema/version info, a high-level product summary, and a structured list of implemented features across auth, backend, and UI."
}