{
  "backend/main.mo": "Defines actor-level data types for activities, reminders, finances, habits, journals, and user profiles with associated metadata and enums. No business logic is implemented; the file only declares structured types.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, test IDs, and confidence levels. Used for tracking work on mobile pie chart overflow and finance trends chart sizing.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing each frontend file’s purpose, behavior, and UI logic. Serves as a reference index for frontend components and utilities.",
  "frontend/index.css": "Base Tailwind setup defining CSS variables for light/dark themes and applying global background, text, and border styles. Provides the OKLCH color system and shared UI tokens.",
  "frontend/index.html": "Minimal HTML entry point with root div and script loading main.tsx. Sets viewport and document title.",
  "frontend/src/App.tsx": "Main app component handling theme, authentication state, profile setup gating, date selection, and switching between daily and main dashboards. Renders header, footer, toasts, and responsive layouts.",
  "frontend/src/components/AppButton.tsx": "A wrapper around the UI Button component that injects a shared 'app-button' class. Ensures consistent button styling across the app.",
  "frontend/src/components/CalendarView.tsx": "Interactive monthly calendar with date navigation, today shortcut, and reminder indicators. Computes month layout and calls onDateSelect when a day is chosen.",
  "frontend/src/components/charts/PiePercentLabel.tsx": "Custom Recharts label renderer placing percentage text inside pie slices, adapting size for mobile.",
  "frontend/src/components/DailyDashboard.tsx": "Renders date header (desktop-only) and tabbed daily sections for overview, activities, finance, habits, and journal. Switches content based on selected tab.",
  "frontend/src/components/Footer.tsx": "Simple footer displaying the year with subtle styling and a top border.",
  "frontend/src/components/Header.tsx": "Renders the app header with navigation, theme toggle, authentication status, and user dropdown. Handles login state, profile loading, and logout actions.",
  "frontend/src/components/LoginButton.tsx": "Provides a login button integrated with Internet Identity, handling login attempts, disabled states, and stale-session recovery.",
  "frontend/src/components/MainDashboard.tsx": "Displays the main dashboard with timeframe controls and multiple trend charts. Fetches and aggregates finance, habit, and activity data across recent days.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or updating a user's profile username. Submits profile data and shows loading and error states.",
  "frontend/src/components/sections/DailyOverviewSection.tsx": "Shows a daily overview with activity, finance, habits, and journal charts. Computes daily metrics and renders responsive pie charts.",
  "frontend/src/components/sections/FinanceSection.tsx": "Manages daily finance entries including creation and deletion, and displays a pie chart summary. Uses dialogs and form state for adding new finance items.",
  "frontend/src/components/sections/HabitsSection.tsx": "Displays daily habits, allows creating, updating, deleting habits, and shows progress via a pie chart.",
  "frontend/src/components/sections/JournalSection.tsx": "Provides a daily journal editor with load, create, and update functionality tied to the selected date.",
  "frontend/src/components/sections/OverviewSection.tsx": "Manages time-based activities for a day, including creation, deletion, and duration calculation.",
  "frontend/src/components/sections/RemindersSection.tsx": "Handles daily reminders with creation and deletion features through a modal interface.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on user identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useIsMobile.ts": "Detects whether the viewport width is below the mobile breakpoint and updates on resize.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating user profiles, activities, finances, and other backend data using an actor and Internet Identity.",
  "frontend/src/index.css": "Defines Tailwind base layers, color variables, dark mode overrides, and custom dashboard card styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/src/utils/errors.ts": "Normalizes various error formats into consistent user-friendly messages.",
  "frontend/src/utils/localDate.ts": "Implements local date formatting, parsing, manipulation, and range utilities that avoid timezone issues.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, animations, and plugins based on CSS variables.",
  "project_state.json": "Defines the current project state, including versioning, high-level app summary, and a list of implemented features with IDs, descriptions, and synonyms. Captures authentication, access control, user profile handling, URL-secret extraction, and date utility capabilities."
}