{
  "backend/main.mo": "Defines a large set of shared types for activities, reminders, finances, habits, journals, dashboards, and user profiles within the main actor.",
  "feature_evidence.json": "Lists feature evidence records mapping feature requirements to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten summaries describing the purpose and behavior of various frontend files.",
  "frontend/index.css": "Defines global Tailwind CSS variables and base styles for light and dark themes.",
  "frontend/index.html": "HTML entry point that loads fonts and mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component handling theme, authentication, profile setup gating, and switching between daily and main dashboard views.",
  "frontend/src/components/activities/DailyTimeline.tsx": "Displays a visual daily timeline of timed activities with hour markers and colored segments.",
  "frontend/src/components/AppButton.tsx": "Wrapper around the UI Button component adding consistent app-wide styling via the app-button class.",
  "frontend/src/components/CalendarView.tsx": "Monthly calendar component with reminder indicators, month navigation, and date selection.",
  "frontend/src/components/charts/PiePercentLabel.tsx": "Custom rendering function for Recharts pie chart slice percentage labels, positioned inside slices.",
  "frontend/src/components/DailyDashboard.tsx": "Renders the daily dashboard with tabbed sections for overview, activities, finance, habits, and journal, using the selected date.",
  "frontend/src/components/Footer.tsx": "Simple footer component with styled container and placeholder content.",
  "frontend/src/components/Header.tsx": "Header with navigation, theme toggle, and user profile menu, supporting login state and view switching.",
  "frontend/src/components/LoginButton.tsx": "Login button that triggers Internet Identity login, handles stale sessions, and shows loading state.",
  "frontend/src/components/MainDashboard.tsx": "Main dashboard showing trends and charts for finances, habits, activities, and time spent with selectable timeframes.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal for creating or repairing a user profile by setting a username and saving via backend mutation.",
  "frontend/src/components/sections/DailyOverviewSection.tsx": "Aggregates activities, finances, habits, and journal data for a selected date and displays multiple pie charts summarizing daily distributions.",
  "frontend/src/components/sections/FinanceSection.tsx": "Manages daily finance entries with create/delete actions and displays a pie chart summarizing income, expenses, and investments.",
  "frontend/src/components/sections/HabitsSection.tsx": "Handles daily habits with create/update/delete functionality and shows completion stats via a pie chart.",
  "frontend/src/components/sections/JournalSection.tsx": "Loads, edits, and saves a daily journal entry with identity checks and autosync behavior.",
  "frontend/src/components/sections/OverviewSection.tsx": "Displays and manages daily activities, including creation, deletion, grouping, and timeline visualization.",
  "frontend/src/components/sections/RemindersSection.tsx": "Creates and lists daily reminders with delete functionality and a simple UI for managing entries.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity, refetching dependent queries when the actor updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useIsMobile.ts": "Detects whether the viewport width is below 768px and updates on resize.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating user profiles, activities, and related backend data via the actor.",
  "frontend/src/index.css": "Defines global Tailwind layers, CSS variables for themes, and base typography and component styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and loads global styles.",
  "frontend/src/utils/activityColors.ts": "Provides deterministic OKLCH-based colors for activities using a string hash.",
  "frontend/src/utils/activityTime.ts": "Utilities for parsing times and sorting activities by time-of-day.",
  "frontend/src/utils/errors.ts": "Normalizes backend errors into user-friendly messages.",
  "frontend/src/utils/localDate.ts": "Utilities for working with local YYYY-MM-DD dates without timezone shifts.",
  "frontend/src/utils/timelineStyles.ts": "Generates gradient and glow styles for timeline segments based on OKLCH colors.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL and hash parameters, persist them in sessionStorage, and clear them from the hash for session‑scoped state like tokens.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, fonts, container settings, animations, and plugin usage.",
  "project_state.json": "Stores project metadata describing DailyOS features, architecture, and existing functional modules with versioned capability definitions."
}