{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Mobile-only Recharts layout fixes (pie label overflow + Finance Trends width)",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Keep mobile pie-chart percentage labels fully contained within dashboard cards without affecting desktop/tablet layout.",
      "acceptanceCriteria": [
        "On mobile viewport widths, all Recharts PieChart percentage labels are fully visible and never clipped by the card container.",
        "On mobile, no pie chart SVG elements (labels, label lines, slices, legend/tooltip containers if present) render outside the visible card content area.",
        "Percentages remain displayed on mobile (not removed/hidden).",
        "Desktop/tablet layout and sizing for the same charts remains visually unchanged.",
        "The fix applies to pie charts used in the Daily Overview section and any other pie charts that render percentage labels."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useIsMobile.ts",
          "operation": "create",
          "description": "Add a small viewport detection hook (aligned to Tailwind's md breakpoint) so pie charts can apply label/radius adjustments only on mobile."
        },
        {
          "path": "frontend/src/components/charts/PiePercentLabel.tsx",
          "operation": "create",
          "description": "Create a reusable Recharts Pie custom label renderer that positions percentage text inside the slice (to prevent overflow) and supports smaller mobile-friendly font sizing."
        },
        {
          "path": "frontend/src/components/sections/DailyOverviewSection.tsx",
          "operation": "modify",
          "description": "Update the Daily Overview pie charts that render percentage labels to use mobile-only containment adjustments (e.g., reduced outerRadius, mobile-specific chart margins, and the custom inside-slice percent label renderer) while preserving the current desktop label behavior and ensuring no SVG element overflows the card."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Make the Finance Trends line chart use the full available card width on mobile without changing data/logic or desktop layout.",
      "acceptanceCriteria": [
        "On mobile viewport widths, the Finance Trends line chart uses the full available width inside its card (no unnecessary horizontal compression).",
        "On mobile, x-axis labels are readable and evenly spaced relative to the available width (no excessive crowding caused by container padding/margins).",
        "No changes are made to the Finance Trends data series, query logic, or tooltip formatting—only layout/styling changes.",
        "Desktop/tablet layout and sizing for Finance Trends remains visually unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/MainDashboard.tsx",
          "operation": "modify",
          "description": "Adjust Finance Trends card content padding/margins for mobile only (keeping md+ unchanged) and tune the LineChart/ResponsiveContainer layout (e.g., mobile-specific chart margins) so the chart expands horizontally to fill the card width without altering any chart data or tooltip formatting."
        }
      ]
    }
  ]
}