{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 65,
  "summary": "DailyOS is a personal daily tracking web app built on the Internet Computer (ICP). Users authenticate with Internet Identity, then create and review per-day records: time-based activities, finance transactions (income/expense/investment), habits (with completion toggles), a daily journal entry, and date-specific reminders. The frontend provides a calendar-driven Daily View with tabbed sections plus a separate Main Dashboard that visualizes recent 7- and 30-day trends via charts. A Motoko canister backend stores user-scoped data keyed by incremental IDs and enforces principal-based access control with admin/user/guest roles.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider and session persistence",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "Identity context"
      ],
      "description": "Provides an InternetIdentityProvider that creates an AuthClient, restores a stored identity on reload, supports login/logout, and exposes login status flags and the current Identity to the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Login button with stale-session recovery",
      "synonyms": [
        "LoginButton",
        "retry login",
        "react-query cache clear on auth"
      ],
      "description": "Implements a login UI that triggers Internet Identity authentication and, if a stale authenticated session is detected, clears the React Query cache and retries login.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "ICP canister actor creation and access-control initialization",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "authenticated actor"
      ],
      "description": "Creates an anonymous or identity-backed canister actor and initializes backend access control by calling _initializeAccessControlWithSecret with a secret token sourced from the URL hash/session. Invalidates and refetches non-actor queries when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Role-based access control with admin bootstrapping",
      "synonyms": [
        "access-control",
        "MixinAuthorization",
        "admin token"
      ],
      "description": "Motoko access-control module supports #admin/#user/#guest roles. The first eligible principal can become admin by presenting the correct token; admins can assign roles. Backend methods gate actions via hasPermission and ownership checks.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "User profile persistence and forced username setup modal",
      "synonyms": [
        "UserProfile",
        "ProfileSetupModal",
        "username repair mode"
      ],
      "description": "Supports fetching and saving the caller’s profile in the canister. The UI forces profile setup when authenticated users have no profile or a blank username, allowing username creation/repair via a modal dialog.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "URL hash secret extraction with session persistence",
      "synonyms": [
        "urlParams",
        "getSecretParameter",
        "sessionStorage secret"
      ],
      "description": "Extracts sensitive parameters (e.g., caffeineAdminToken) from the URL hash, stores them in sessionStorage for the session, and removes them from the URL hash to reduce history/referrer leakage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Timezone-safe local date utilities",
      "synonyms": [
        "formatLocalDate",
        "parseLocalDate",
        "YYYY-MM-DD utilities"
      ],
      "description": "Provides helper functions to format/parse local YYYY-MM-DD strings and generate date ranges (e.g., last N days) without UTC conversion/off-by-one issues.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "App layout with Daily View and Main Dashboard switching",
      "synonyms": [
        "App.tsx view switch",
        "daily vs main"
      ],
      "description": "Root app maintains selected date and toggles between Daily View (calendar-driven per-day tracking) and the Main Dashboard (analytics). Includes global footer and toast Toaster.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Header navigation with theme toggle, user dropdown, and mobile-only view controls",
      "synonyms": [
        "Header",
        "next-themes",
        "mobile nav icons"
      ],
      "description": "Top header shows brand, desktop navigation buttons, and mobile-only icon buttons to switch between Dashboard and Daily View on small screens. Includes theme toggle and authenticated user dropdown with username/loading placeholder and logout.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Calendar month view with date selection and Today shortcut",
      "synonyms": [
        "CalendarView",
        "monthly calendar",
        "selected date"
      ],
      "description": "Interactive calendar supports month navigation, selecting a day to update the active date, and a Today button to jump back to the current date. Selected and today states are visually distinguished.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Reminders for a target date (create/list/delete)",
      "synonyms": [
        "RemindersSection",
        "daily reminders"
      ],
      "description": "Allows authenticated users to add reminders (title + optional description) for the selected day, list them, and delete them. Uses dialogs for entry and react-query cache invalidation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Time-based activity tracking per date (create/list/delete)",
      "synonyms": [
        "OverviewSection",
        "activities",
        "time tracking"
      ],
      "description": "Users can create activities for a selected date with optional start/end times or explicit duration, view the day’s list, see computed duration display, and delete activities. Backend enforces per-caller access and ownership.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Finance tracking per date (create/list/delete) with daily summary pie",
      "synonyms": [
        "FinanceSection",
        "transactions",
        "income/expense/investment"
      ],
      "description": "Users can add finance entries (stored as cents) categorized as income/expense/investment, view daily transactions, see daily totals and a pie chart breakdown, and delete entries. Backend enforces per-caller access.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Habit checklist per date with completion toggle and progress visualization",
      "synonyms": [
        "HabitsSection",
        "toggle completion",
        "completion rate"
      ],
      "description": "Users can add habits for a day, toggle completion (update), delete habits, and view completion rate plus a pie chart of completed vs not completed.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "Daily journal entry per date (create/read/update) with save button gating",
      "synonyms": [
        "JournalSection",
        "daily notes"
      ],
      "description": "Loads an existing journal entry for the selected date or creates one on first save; supports updating content and timestamps. Editor is disabled when not authenticated.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Daily View tabbed sections with mobile-only abbreviated labels",
      "synonyms": [
        "DailyDashboard tabs",
        "O/A/F/H/J labels",
        "responsive tab labels"
      ],
      "description": "Daily View uses five tabs (Overview, Activities, Finance, Habits, Journal). On phone-sized screens, tab labels abbreviate to O/A/F/H/J while tablet/desktop retains full labels.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Read-only Daily Overview tab (per-day summary cards)",
      "synonyms": [
        "DailyOverviewSection",
        "daily summary"
      ],
      "description": "Provides a read-only overview for the selected date with four cards: activities time distribution pie, finance category pie, habits completion pie, and a journal preview.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Main Dashboard analytics with 7/30 day timeframe selector and finance net-balance-only trends",
      "synonyms": [
        "MainDashboard",
        "finance trends",
        "net balance chart"
      ],
      "description": "Aggregated dashboard with a rolling timeframe selector (Last 7 days / Last 30 days). Renders Finance Trends as a single Net Balance line chart (Compare option removed), plus finance distribution percentages, income-only/expense-only/investment-only trend charts, habits completion rate trend, and time-spent-by-activity pie aggregation.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Standardized toasts and error normalization for backend operations",
      "synonyms": [
        "sonner toasts",
        "normalizeError"
      ],
      "description": "Mutations show success/error toasts; errors from backend/runtime are normalized into user-friendly messages (not authenticated/unauthorized/anonymous principal cases handled explicitly).",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Reusable AppButton wrapper and dashboard card styling system",
      "synonyms": [
        "AppButton",
        "dashboard-card accents",
        "section-themed cards"
      ],
      "description": "Wraps the base Button to apply consistent interaction styling and uses a shared Tailwind/CSS-variable system for section-themed dashboard cards (overview/finance/habits/journal) including borders, subtle overlays, and hover elevation effects.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Mobile header layout spacing refinements",
      "synonyms": [
        "phone-only top bar spacing",
        "equal spacing controls",
        "brand-to-nav gap"
      ],
      "description": "On phone-sized screens, adjusts Header top bar spacing so the Dashboard button, Daily View button, and theme toggle are evenly spaced; adds extra gap between the DailyOS brand text and the Dashboard button; keeps the profile icon aligned top-right with no functional behavior changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Mobile-only dashboard chart width improvements",
      "synonyms": [
        "stretch charts on mobile",
        "wider Finance/Habits charts"
      ],
      "description": "On mobile, increases usable horizontal space for dashboard charts (notably Finance and Habits) within their cards to improve readability, without changing chart logic or data aggregation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Mobile-only Daily View layout reordered with date at top",
      "synonyms": [
        "Daily View mobile reorder",
        "date text top",
        "Date→Calendar→Reminders→Tabs"
      ],
      "description": "On mobile, moves the current date text to the top and reorders the Daily View layout to: Date header → Calendar → Reminders → tabbed sections. Desktop/tablet layout remains unchanged.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-24",
      "title": "Profile dropdown shows username instead of 'My Account'",
      "synonyms": [
        "user menu label",
        "replace My Account"
      ],
      "description": "Updates the profile dropdown trigger/label (desktop and mobile) to display the current user's username in place of the 'My Account' text, keeping dropdown behavior and Logout unchanged.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "feature-fix-mobile-only-pie-chart-label-overflow-so-that-all-pie-chart-content-including-percentage-labels-stays-fully-visible-and-contained-within-the-dashboard-card-boundaries-on-small-screens-without-changing-desktop-layout-and-without-removing-percentages",
      "title": "Fix mobile-only pie chart label overflow so that all pie chart content (including percentage labels) stays fully visible and contained within the dashboard card boundaries on small screens, without changing desktop layout and without removing percentages.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    },
    {
      "id": "feature-fix-mobile-only-finance-trends-chart-sizing-so-the-line-chart-expands-horizontally-to-use-the-full-available-card-width-improving-readability-of-x-axis-labels-and-the-plotted-line-without-changing-chart-data-logic-and-without-reducing-desktop-card-width-or-affecting-desktop-layout",
      "title": "Fix mobile-only Finance Trends chart sizing so the line chart expands horizontally to use the full available card width (improving readability of x-axis labels and the plotted line) without changing chart data/logic and without reducing desktop card width or affecting desktop layout.",
      "reqIds": [
        "REQ-5"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Mobile-only: pie chart percentage labels overflow/cut off; ensure labels fit within card bounds without affecting desktop",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Mobile-only: Finance Trends chart is horizontally compressed inside its card; stretch to full available width without changing data/logic or desktop layout",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is React + TypeScript, using shadcn/Radix-style UI primitives and Tailwind CSS with OKLCH design tokens.",
    "Data fetching/mutations use @tanstack/react-query with per-entity hooks and cache invalidation after mutations.",
    "Authentication uses DFINITY Internet Identity via @dfinity/auth-client; identity is restored on reload and exposed via a context provider.",
    "Canister interaction is encapsulated in a useActor hook that creates an anonymous or identity-backed actor and refreshes dependent queries when the actor changes.",
    "Backend is a Motoko actor canister with in-memory Map-based storage per entity type and incremental counters for IDs.",
    "Multi-tenant model: records include an author Principal; backend filters queries by caller and enforces ownership (admin override).",
    "Authorization bootstraps an admin via a secret token (from URL hash/session) matched against CAFFEINE_ADMIN_TOKEN env var; other principals are assigned user role.",
    "UI is split into Daily View (calendar + reminders sidebar; tabbed sections) and a Main Dashboard (analytics/trends).",
    "User feedback uses sonner toasts; errors are normalized to user-friendly messages via a shared normalizeError utility.",
    "Sensitive URL hash secrets are persisted to sessionStorage and removed from the URL to reduce leakage."
  ],
  "known_issues": [
    "MainDashboard issues many per-day queries by manually calling up to 31 useGetFinancesByDate/useGetHabitsByDate/useGetActivitiesByDate hooks; for 7-day view it still creates extra queries with empty dates, increasing network load.",
    "CalendarView calls useGetRemindersByDate for every day cell (including blank cells with dateStr=''), causing heavy query fan-out in month view.",
    "useGetAllReminderDates is currently a stub that always returns an empty Set and is not used to power calendar reminder indicators.",
    "DailyOverviewSection renders journal content via dangerouslySetInnerHTML without sanitization, which can enable XSS if journal content contains HTML.",
    "Finance entry creation uses parseFloat without NaN guarding; invalid input can throw when converted to BigInt.",
    "Backend storage uses in-memory Maps only; without stable storage, data will be lost on canister upgrade/reinstall.",
    "Backend initialization traps if CAFFEINE_ADMIN_TOKEN env var is not set; authenticated actor initialization always calls _initializeAccessControlWithSecret and may fail in misconfigured deployments.",
    "saveCallerUserProfile only updates username, ignoring other fields (email/theme/language) passed from the client, which may surprise callers.",
    "TimeSpentChart aggregation in MainDashboard uses only activity.duration and ignores startTime/endTime-derived durations, undercounting time for activities logged with times.",
    "Mobile: pie chart percentage labels overflow/cut off outside card bounds; labels must remain visible and contained within card on mobile only."
  ],
  "isFixRequest": true,
  "gameProjectType": "none",
  "projectName": "DailyOS",
  "clarification_mode": "pro",
  "clarification_rounds": 0
}