{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "DailyOS is a calendar-driven personal tracking web app built on the Internet Computer (ICP). Users authenticate via DFINITY Internet Identity, then manage per-day data including time-based activities (with a 24-hour timeline visualization), finance entries (income/expense/investment stored as cents), daily habits (checklist with completion toggles and progress charts), a single daily journal entry (create/update), and date-specific reminders (with monthly calendar indicators). The frontend uses React + TypeScript with TanStack React Query for typed canister CRUD and multi-date batch queries, Recharts for analytics dashboards (last 7/30 days), and Tailwind/shadcn-ui styling with light/dark theming. The Motoko backend stores user-scoped entities keyed by incremental IDs and enforces principal-based authorization with admin bootstrapping via an environment token plus a user-provided secret.",
  "existing_features": [
    {
      "id": "IF-1",
      "title": "Internet Identity authentication provider and session restoration",
      "synonyms": [
        "II login",
        "AuthClient integration",
        "Identity context/provider"
      ],
      "description": "Provides an InternetIdentityProvider that initializes an AuthClient, restores an authenticated identity on reload, supports login/logout, and exposes identity and login status flags to the app.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-2",
      "title": "Login button with stale-session recovery",
      "synonyms": [
        "LoginButton",
        "react-query cache clear on auth",
        "retry login"
      ],
      "description": "Implements a login UI that triggers Internet Identity authentication and, when a stale authenticated session is detected (already authenticated error), clears the React Query cache and retries login.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-3",
      "title": "ICP canister actor creation (anonymous/authenticated) with auth initialization and query invalidation",
      "synonyms": [
        "useActor",
        "createActorWithConfig",
        "authenticated actor refresh"
      ],
      "description": "Creates an anonymous canister actor when logged out and an identity-backed actor when logged in; on authenticated actor creation, calls the backend access-control initializer with a secret token and invalidates/refetches all non-actor React Query caches when the actor changes.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-4",
      "title": "Secret token extraction from URL hash with session persistence and URL cleanup",
      "synonyms": [
        "getSecretParameter",
        "caffeineAdminToken hash",
        "sessionStorage token persistence"
      ],
      "description": "Extracts sensitive parameters from the URL hash fragment, persists them in sessionStorage for the session, and removes them from the URL hash to reduce history/referrer leakage.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-5",
      "title": "Backend access-control system with admin bootstrap and role APIs",
      "synonyms": [
        "AccessControl",
        "MixinAuthorization",
        "role assignment",
        "isCallerAdmin"
      ],
      "description": "Motoko AccessControl module assigns roles (#admin/#user/#guest) and enforces permission checks; MixinAuthorization exposes initialization using an env token plus user-provided secret, role lookup, admin checks, and admin-only role assignment.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-6",
      "title": "User profile persistence and setup-status API",
      "synonyms": [
        "UserProfile CRUD",
        "getSetupStatus",
        "profile save/get"
      ],
      "description": "Backend supports fetching and saving the caller profile plus a lightweight setup-status method; frontend provides hooks to fetch profile/setup status and to save the profile, with cache invalidation on success.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-7",
      "title": "Profile setup modal with first-time setup and username repair mode",
      "synonyms": [
        "ProfileSetupModal",
        "blocking setup gate",
        "username repair"
      ],
      "description": "Shows a blocking modal when an authenticated user needs initial setup (no profile) or has an empty username; allows setting a username and saving via mutation with toast feedback.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-8",
      "title": "Typed React Query hook layer for canister CRUD and batch range queries",
      "synonyms": [
        "useQueries",
        "query hooks",
        "mutations + invalidation",
        "range queries"
      ],
      "description": "Implements typed React Query hooks for fetching/mutating activities, finances, habits, journals, reminders, and profile data; includes multi-date range queries returning grouped Maps/Sets and consistent success/error toasts with normalized error messages.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-9",
      "title": "Local date utilities for timezone-safe calendar operations",
      "synonyms": [
        "YYYY-MM-DD local dates",
        "date range generation",
        "month helpers"
      ],
      "description": "Provides helpers to format/parse local YYYY-MM-DD strings, generate ranges (last N days, month dates), compute month boundaries, and validate date strings without UTC conversion pitfalls.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-10",
      "title": "Daily View layout with calendar sidebar, reminders panel, and tabbed daily dashboard",
      "synonyms": [
        "Daily View",
        "calendar-driven UI",
        "DailyDashboard tabs"
      ],
      "description": "Daily View presents a month calendar with date selection, a reminders section for the selected date, and a tabbed dashboard with Overview/Activities/Finance/Habits/Journal sections including responsive date headers.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-11",
      "title": "Monthly calendar with navigation, Today shortcut, and reminder indicators via a single range query",
      "synonyms": [
        "CalendarView",
        "month navigation",
        "reminder dots"
      ],
      "description": "Interactive calendar supports previous/next month navigation and a Today button; reminder indicator dots are driven by a single per-month range query returning a Set of dates that have reminders.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-12",
      "title": "Reminders per target date (create/list/delete)",
      "synonyms": [
        "RemindersSection",
        "daily reminders CRUD"
      ],
      "description": "Authenticated users can add reminders (title + optional description) for a selected day, list them, and delete them; reminder date indicators update through query invalidation.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-13",
      "title": "Time-based activity tracking per date (create/list/delete) with validation and duration calculation",
      "synonyms": [
        "Activities",
        "time tracking",
        "duration minutes"
      ],
      "description": "Users can create daily activities with start/end times, client-side validation (both times required; end after start), automatic duration calculation, listing, and deletion.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-14",
      "title": "Activity grouping, ordering, and deterministic coloring by activity name",
      "synonyms": [
        "group by name",
        "time-of-day sorting",
        "stable activity colors"
      ],
      "description": "Activities are grouped by identical name while still showing individual entries; groups and entries are ordered by time-of-day descending (later first) and share deterministic OKLCH colors derived from the activity name.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-15",
      "title": "24-hour daily timeline visualization for timed activities",
      "synonyms": [
        "DailyTimeline",
        "timeline segments",
        "hour markers"
      ],
      "description": "Renders a 24-hour horizontal timeline with hour markers and positioned activity segments using gradients/glow derived from deterministic colors; shows segment labels when wide enough and supports hover polish.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-16",
      "title": "Finance tracking per date (create/list/delete) with daily totals and pie chart",
      "synonyms": [
        "transactions",
        "income/expense/investment",
        "finance summary"
      ],
      "description": "Users can add categorized finance entries (income/expense/investment) stored as cents, view daily transactions, see daily totals and a pie breakdown, and delete entries; actions are gated by authentication.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-17",
      "title": "Habit checklist per date with completion toggle, deletion, and progress visualization",
      "synonyms": [
        "HabitsSection",
        "toggle completion",
        "completion rate"
      ],
      "description": "Users can create habits for a day, toggle completion (update), delete habits, and view a completion-rate summary and completed vs not-completed pie chart.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-18",
      "title": "Daily journal entry per date (read/create/update) with authenticated editing",
      "synonyms": [
        "JournalSection",
        "daily notes"
      ],
      "description": "Loads an existing journal entry for the selected date or creates one on first save; supports updating content and timestamps. Editor/save actions are gated by authentication.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-19",
      "title": "Daily overview aggregation with Recharts pies and mobile-safe in-slice percent labels",
      "synonyms": [
        "DailyOverviewSection",
        "PiePercentLabel",
        "overview charts"
      ],
      "description": "Aggregates a selected day’s activities (time by name), finances (totals by type), and habits (completed vs not) into pie charts and shows a journal preview; uses a custom in-slice percent label renderer for mobile readability.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-20",
      "title": "Main dashboard analytics for last 7/30 days using batch queries",
      "synonyms": [
        "MainDashboard",
        "trend charts",
        "range analytics"
      ],
      "description": "Provides an analytics dashboard with a 7-day/30-day timeframe selector; uses multi-date batch queries to compute and render finance net trends and breakdowns, income/expense/investment trends, habit completion trends, and time-spent-by-activity summaries.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-21",
      "title": "Responsive layout helpers and mobile viewport detection",
      "synonyms": [
        "useIsMobile",
        "responsive charts"
      ],
      "description": "Includes a viewport hook (<768px) used to adjust chart sizing/margins and label rendering for mobile devices.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-22",
      "title": "Token-based design system, theme switching, and consistent UI primitives",
      "synonyms": [
        "Tailwind OKLCH tokens",
        "next-themes",
        "AppButton wrapper",
        "shadcn/ui"
      ],
      "description": "Supports light/dark/system themes via next-themes; uses Tailwind + OKLCH CSS variables for consistent theming; standardizes button styling via AppButton and uses shadcn/ui primitives across dialogs, tabs, dropdowns, etc.",
      "reqIds": [],
      "version": 1
    },
    {
      "id": "IF-23",
      "title": "Playful visual-only UI redesign (typography, palette, spacing, micro-interactions)",
      "synonyms": [
        "Nunito typography refresh",
        "playful palette",
        "hover/active polish",
        "visual-only redesign"
      ],
      "description": "Implements a visual-only redesign: global Nunito font and stronger typographic hierarchy, refreshed OKLCH color tokens (including dark mode), and consistent rounded corners/shadows/hover interactions across cards, calendar, buttons, and timeline without changing functional behavior.",
      "reqIds": [
        "REQ-11",
        "REQ-12",
        "REQ-13",
        "REQ-14",
        "REQ-15"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-the-footer-text-2026-built-with-using-caffeine-ai-from-the-selected-footer-element-at-xpath-html-1-body-1-div-1-div-1-footer-1-div-1-div-1-ensuring-the-footer-s-layout-spacing-and-the-rest-of-the-app-s-layout-spacing-and-functionality-remain-unchanged",
      "title": "Remove the footer text “© 2026. Built with using caffeine.ai” from the selected footer element at XPath `/html[1]/body[1]/div[1]/div[1]/footer[1]/div[1]/div[1]`, ensuring the footer’s layout/spacing and the rest of the app’s layout, spacing, and functionality remain unchanged.",
      "reqIds": [
        "REQ-16"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove footer text “© 2026. Built with using caffeine.ai” without affecting layout/spacing/functionality elsewhere",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "architectural_notes": [
    "Frontend is React + TypeScript using shadcn/ui (Radix primitives) and Tailwind CSS with tokenized OKLCH CSS variables and class-based dark mode.",
    "Data access is centralized in @tanstack/react-query hooks that wrap canister calls, handle enabled-guards, and invalidate caches after mutations.",
    "Authentication is encapsulated in an InternetIdentityProvider using @dfinity/auth-client, restoring identities on reload and exposing login/logout state.",
    "Canister interaction is abstracted by a useActor hook that creates anonymous vs identity-backed actors and re-initializes/invalidate-refetches queries on identity changes.",
    "Backend authorization uses an AccessControl module mixed into the canister via a Motoko mixin (MixinAuthorization) with role checks and admin bootstrap.",
    "Backend uses in-memory Map stores with incremental counters for IDs; each record includes author Principal and backend overwrites author/id on create.",
    "Batch/range query endpoints exist for major entities (activities/finances/habits/journals/reminders) to reduce per-date query fanout; frontend regroups results into Maps/Sets keyed by date.",
    "Date handling in the UI uses local YYYY-MM-DD utilities to avoid timezone/UTC conversion pitfalls across calendar and dashboards.",
    "Charts are implemented with Recharts, including a custom pie percent label renderer that places labels inside slices for mobile safety.",
    "Sensitive secret handling is done via URL-hash extraction with sessionStorage persistence and hash cleanup to reduce token leakage in history/referrers."
  ],
  "known_issues": [
    "Backend persistence is in-memory only (no stable storage), so data can be lost on canister upgrade/reinstall.",
    "Authenticated actor initialization calls _initializeAccessControlWithSecret and will trap if CAFFEINE_ADMIN_TOKEN env var is not configured, breaking authenticated flows.",
    "Admin bootstrapping can be “missed”: if the first authenticated call initializes a principal as #user (wrong/empty token), that principal cannot later be upgraded to #admin by re-initializing (initialize is no-op if role already set).",
    "AccessControl.getUserRole traps for unregistered principals; if initialization is skipped/failed, many endpoints can trap with \"User is not registered\".",
    "Journal preview in DailyOverviewSection renders user content via dangerouslySetInnerHTML without sanitization (XSS risk).",
    "Finance creation uses parseFloat(formData.amount) and converts to BigInt without robust NaN/empty validation; invalid input can cause runtime errors.",
    "DailyTimeline uses window.innerWidth during render (not SSR-safe) and hour-label density may not update on resize unless a re-render occurs.",
    "Backend range queries filter via dates.findIndex inside per-record filters (O(records × dates)), which may degrade with larger datasets.",
    "Backend allows multiple journals per (author, date); getJournalByDate returns the first match, which is non-deterministic if duplicates exist.",
    "Two different CSS theme files exist (frontend/index.css and frontend/src/index.css); only src/index.css is imported by the app, which can cause drift/confusion."
  ],
  "isFixRequest": false,
  "gameProjectType": "none",
  "projectName": "DailyOS",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}